export default {
  projections: {
    СервернаяE: {
      протокол: {
        __caption__: 'Протокол'
      },
      настройки: {
        __caption__: 'Настройки'
      },
      iP: {
        __caption__: 'IP'
      },
      порт: {
        __caption__: 'Порт'
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        имя: {
          __caption__: 'Имя'
        }
      },
      контроллер: {
        __caption__: 'Контроллер',
        модель: {
          __caption__: 'Модель'
        },
        iDКонтроллера: {
          __caption__: 'I d контроллера'
        },
        сенсоры: {
          __caption__: 'Сенсоры',
          тип: {
            __caption__: 'Тип'
          }
        }
      }
    },
    СервернаяL: {
      протокол: {
        __caption__: 'Протокол'
      },
      настройки: {
        __caption__: 'Настройки'
      },
      iP: {
        __caption__: 'IP'
      },
      порт: {
        __caption__: 'Порт'
      },
      сотрудник: {
        __caption__: 'Имя',
        имя: {
          __caption__: 'Имя'
        }
      }
    }
  },
  validations: {
    iP: {
      __caption__: 'IP'
    },
    настройки: {
      __caption__: 'Настройки'
    },
    порт: {
      __caption__: 'Порт'
    },
    протокол: {
      __caption__: 'Протокол'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    },
    контроллер: {
      __caption__: 'Контроллер'
    }
  }
};
